tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "aws/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "iann0036/iamlive"
tap "romkatv/powerlevel10k"
tap "warrensbox/tap"

brew "ansible"
brew "arkade"
brew "awscli"
brew "bash"
brew "consul"
brew "coreutils"
brew "bat"
brew "dasel"
brew "dfu-util"
brew "docker-compose"
brew "docker-machine"
brew "dos2unix"
brew "fd"
brew "gettext"
brew "git"
brew "golangci-lint"
brew "grpcurl"
brew "helm"
brew "hey"
brew "httpie"
brew "hugo"
brew "istioctl"
brew "jq"
brew "jump"
brew "just"
brew "k3d"
brew "k3sup"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "linkerd"
brew "mas"
brew "md5sha1sum"
brew "mercurial"
brew "nomad"
brew "platformio"
brew "pinentry-mac"
brew "packer"
brew "shellcheck"
brew "tree"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "goreleaser/tap/goreleaser"
brew "romkatv/powerlevel10k/powerlevel10k"

brew "asdf"
brew "go"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rustup-init"
brew "zig"

cask "balenaetcher"

cask "logitech-camera-settings"
cask "logi-options-plus"

cask "istat-menus"
cask "shiftit"
cask "spotify"
cask "the-unarchiver"

cask "arduino-ide"
cask "easyeda"
cask "autodesk-fusion360"
cask "prusaslicer"
cask "openscad"

cask "diffmerge"
# cask "docker"
cask "rancher"
cask "visual-studio-code"

cask "iterm2"
cask "warp"
cask "lens"
cask "rapidapi"
cask "sourcetree"
cask "vmware-fusion"

cask "discord"
cask "keybase"
cask "slack"

cask "brave-browser"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "opera-developer"
cask "tor-browser"

cask "zoom"
cask "grammarly"

mas "Grammarly for Safari", id: 1462114288
