tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "aws/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "iann0036/iamlive"
# tap "romkatv/powerlevel10k"
tap "warrensbox/tap"

brew "ansible"
brew "arkade"
brew "awscli"
brew "bash"
brew "bat"
brew "consul"
brew "coreutils"
brew "dasel"
brew "dfu-util"
brew "docker-compose"
brew "dos2unix"
brew "fd"
brew "gettext"
brew "git"
brew "golangci-lint"
brew "grpcurl"
brew "helm"
brew "hey"
brew "httpie"
brew "hugo"
brew "jq"
brew "just"
brew "k3d"
brew "k3sup"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "mas"
brew "md5sha1sum"
brew "mercurial"
brew "platformio"
brew "shellcheck"
brew "tree"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "goreleaser/tap/goreleaser"
# brew "romkatv/powerlevel10k/powerlevel10k"

brew "asdf"
brew "go"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rustup-init"
brew "zig"

cask "balenaetcher"

cask "logitech-camera-settings"
cask "logi-options-plus"

cask "istat-menus"
cask "shiftit"
cask "spotify"
cask "the-unarchiver"

# cask "arduino-ide"
cask "easyeda"
cask "autodesk-fusion360"
cask "prusaslicer"
cask "openscad"

cask "diffmerge"
# cask "docker"
cask "rancher"
cask "visual-studio-code"

cask "iterm2"
cask "warp"
cask "rapidapi"
cask "sourcetree"
cask "vmware-fusion"

cask "discord"
cask "keybase"
cask "slack"

cask "brave-browser"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "opera-developer"
cask "tor-browser"

cask "raspberry-pi-imager"
cask "rectangle"

cask "zoom"
cask "grammarly"

mas "Grammarly for Safari", id: 1462114288

vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
